### Merging Dataframes

<b>Loading the libraries

In [2]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

<b>Building DataFrame using two dictionaries

In [9]:
names = pd.DataFrame({'Name':['bhavitha','Parvathy','Revathy', 'Femina', 'Suhaina'],
                       'ID':[1,2,3,4,5]
                     })
Salary = pd.DataFrame({'Salary':[10000,20000,30000,40000,50000],
                       'ID':[1,2,3,4,5]})
Qualification = pd.DataFrame({'Education':['btech.EEE', 'btech.MP','bsc.maths','bsc.statistics', 'btech.IT'],
                             'ID':[1,2,3,4,5]})

<b> Merging two Dictionaries on ID

In [12]:
df = pd.merge(names,Salary , on = 'ID')
df.set_index ('ID' , inplace= True)

In [13]:
df

        Name  Salary
ID
1   bhavitha   10000
2   Parvathy   20000
3    Revathy   30000
4     Femina   40000
5    Suhaina   50000

In [14]:
df =pd.merge(names, Salary , on ='ID' , how = 'left')

In [15]:
df

       Name  ID  Salary
0  bhavitha   1   10000
1  Parvathy   2   20000
2   Revathy   3   30000
3    Femina   4   40000
4   Suhaina   5   50000

In [ ]:
Salary = pd.DataFrame({'Salary':[10000,20000,30000,40000,50000,60000],
                       'ID':[1,2,3,4,5]})
Qualification = pd.DataFrame({'Education':['btech.EEE', 'btech.MP','bsc.maths','bsc.statistics', 'btech.IT'],
                             'ID':[1,2,3,4,5]})

In [18]:
df = pd.merge(Salary,Qualification , on ='ID', how ='outer')

In [19]:
df

   Salary  ID       Education
0   10000   1       btech.EEE
1   20000   2        btech.MP
2   30000   3       bsc.maths
3   40000   4  bsc.statistics
4   50000   5        btech.IT